
使用 desc 命令可以查看表的结构，如查看student 表的结构

mysql> desc student;
+--------+--------------+------+-----+---------+-------+
| Field  | Type         | Null | Key | Default | Extra |
+--------+--------------+------+-----+---------+-------+
| name   | varchar(32)  | NO   | PRI | NULL    |       |
| gender | bit(1)       | NO   |     | NULL    |       |
| age    | int(11)      | YES  |     | NULL    |       |
| birth  | date         | YES  |     | NULL    |       |
| gpt    | decimal(4,2) | YES  |     | NULL    |       |
+--------+--------------+------+-----+---------+-------+
5 rows in set (0.00 sec)

查看customer 表的结构

mysql> DESC customer;
+--------+--------------+------+-----+---------+----------------+
| Field  | Type         | Null | Key | Default | Extra          |
+--------+--------------+------+-----+---------+----------------+
| id     | int(11)      | NO   | PRI | NULL    | auto_increment |
| name   | varchar(32)  | YES  |     | NULL    |                |
| gender | bit(1)       | YES  |     | NULL    |                |
| age    | int(11)      | YES  |     | NULL    |                |
| birth  | date         | YES  |     | NULL    |                |
| gpt    | decimal(4,2) | YES  |     | NULL    |                |
+--------+--------------+------+-----+---------+----------------+
6 rows in set (0.00 sec)

使用  show tables 查看数据库中存在的表

mysql> show tables;
+---------------+
| Tables_in_crm |
+---------------+
| customer      |
| student       |
+---------------+
2 rows in set (0.00 sec)



使用 show create table 查看创建表时的语法 

mysql> show create table customer;
+----------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Table    | Create Table                                                                                                                                                                                                                                                                                                    |
+----------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| customer | CREATE TABLE `customer` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL,
  `gender` bit(1) DEFAULT NULL,
  `age` int(11) DEFAULT NULL,
  `birth` date DEFAULT NULL,
  `gpt` decimal(4,2) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=102 DEFAULT CHARSET=utf8 |
+----------+-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
1 row in set (0.00 sec)

